101_backstep/001_backstep/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.02;

boundaryField
{
    inlet
    {
        type            timeVaryingMappedFixedValue;
        offset          0;
	setAverage      off;
    }
    outlet
    {
        type            zeroGradient;
    }
    ".*Wall"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
