101_backstep/001_backstep/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    ".*Wall"
    {
        type            nutkWallFunction;
        value           uniform 0;
        /*
        nutLowReWallFunction
        nutTabulatedWallFunction
        nutURoughWallFunction
        nutUSpaldingWallFunction
        nutUWallFunction		- y+
        nutkAtmRoughWallFunction
        nutkRoughWallFunction
        nutkWallFunction		- y*
        */
    }
    frontAndBack
    {
        type            empty;
    }
}



// ************************************************************************* //
