101_backstep/001_backstep/system/measuringPoints
(2.44E-02 1.02E+00 1.00E+00)
(2.44E-02 1.04E+00 1.00E+00)
(2.44E-02 1.06E+00 1.00E+00)
(2.44E-02 1.09E+00 1.00E+00)
(2.44E-02 1.11E+00 1.00E+00)
(2.44E-02 1.14E+00 1.00E+00)
(2.44E-02 1.16E+00 1.00E+00)
(2.44E-02 1.19E+00 1.00E+00)
(2.44E-02 1.21E+00 1.00E+00)
(2.44E-02 1.23E+00 1.00E+00)
(2.44E-02 1.26E+00 1.00E+00)
(2.44E-02 1.28E+00 1.00E+00)
(2.44E-02 1.31E+00 1.00E+00)
(2.44E-02 1.33E+00 1.00E+00)
(2.44E-02 1.36E+00 1.00E+00)
(2.44E-02 1.38E+00 1.00E+00)
(2.44E-02 1.41E+00 1.00E+00)
(2.44E-02 1.43E+00 1.00E+00)
(2.44E-02 1.45E+00 1.00E+00)
(2.44E-02 1.48E+00 1.00E+00)
(2.44E-02 1.50E+00 1.00E+00)
(2.44E-02 1.53E+00 1.00E+00)
(2.44E-02 1.55E+00 1.00E+00)
(2.44E-02 1.58E+00 1.00E+00)
(2.44E-02 1.60E+00 1.00E+00)
(2.44E-02 1.63E+00 1.00E+00)
(2.44E-02 1.65E+00 1.00E+00)
(2.44E-02 1.67E+00 1.00E+00)
(2.44E-02 1.70E+00 1.00E+00)
(2.44E-02 1.72E+00 1.00E+00)
(2.44E-02 1.75E+00 1.00E+00)
(2.44E-02 1.77E+00 1.00E+00)
(2.44E-02 1.80E+00 1.00E+00)
(2.44E-02 1.82E+00 1.00E+00)
(2.44E-02 1.85E+00 1.00E+00)
(2.44E-02 1.87E+00 1.00E+00)
(2.44E-02 1.89E+00 1.00E+00)
(2.44E-02 1.92E+00 1.00E+00)
(2.44E-02 1.94E+00 1.00E+00)
(2.44E-02 1.97E+00 1.00E+00)
(2.44E-02 1.99E+00 1.00E+00)
(2.44E-02 2.02E+00 1.00E+00)
(2.44E-02 2.04E+00 1.00E+00)
(2.44E-02 2.07E+00 1.00E+00)
(2.44E-02 2.09E+00 1.00E+00)
(2.44E-02 2.12E+00 1.00E+00)
(2.44E-02 2.14E+00 1.00E+00)
(2.44E-02 2.16E+00 1.00E+00)
(2.44E-02 2.19E+00 1.00E+00)
(2.44E-02 2.21E+00 1.00E+00)
(2.44E-02 2.24E+00 1.00E+00)
(2.44E-02 2.26E+00 1.00E+00)
(2.44E-02 2.29E+00 1.00E+00)
(2.44E-02 2.31E+00 1.00E+00)
(2.44E-02 2.34E+00 1.00E+00)
(2.44E-02 2.36E+00 1.00E+00)
(2.44E-02 2.38E+00 1.00E+00)
(2.44E-02 2.41E+00 1.00E+00)
(2.44E-02 2.43E+00 1.00E+00)
(2.44E-02 2.46E+00 1.00E+00)
(2.44E-02 2.48E+00 1.00E+00)
(2.44E-02 2.51E+00 1.00E+00)
(2.44E-02 2.53E+00 1.00E+00)
(2.44E-02 2.55E+00 1.00E+00)
(2.44E-02 2.58E+00 1.00E+00)
(2.44E-02 2.60E+00 1.00E+00)
(2.44E-02 2.63E+00 1.00E+00)
(2.44E-02 2.65E+00 1.00E+00)
(2.44E-02 2.68E+00 1.00E+00)
(2.44E-02 2.70E+00 1.00E+00)
(2.44E-02 2.73E+00 1.00E+00)
(2.44E-02 2.75E+00 1.00E+00)
(2.44E-02 2.78E+00 1.00E+00)
(2.44E-02 2.80E+00 1.00E+00)
(2.44E-02 2.82E+00 1.00E+00)
(2.44E-02 2.85E+00 1.00E+00)
(2.44E-02 2.87E+00 1.00E+00)
(2.44E-02 2.90E+00 1.00E+00)
(2.44E-02 2.92E+00 1.00E+00)
(2.44E-02 2.95E+00 1.00E+00)
(2.44E-02 2.96E+00 1.00E+00)
(1.00E+00 1.70E-02 1.00E+00)
(1.00E+00 4.13E-02 1.00E+00)
(1.00E+00 6.09E-02 1.00E+00)
(1.00E+00 8.49E-02 1.00E+00)
(1.00E+00 1.12E-01 1.00E+00)
(1.00E+00 1.34E-01 1.00E+00)
(1.00E+00 1.60E-01 1.00E+00)
(1.00E+00 1.83E-01 1.00E+00)
(1.00E+00 2.07E-01 1.00E+00)
(1.00E+00 2.33E-01 1.00E+00)
(1.00E+00 2.56E-01 1.00E+00)
(1.00E+00 2.81E-01 1.00E+00)
(1.00E+00 3.05E-01 1.00E+00)
(1.00E+00 3.31E-01 1.00E+00)
(1.00E+00 3.55E-01 1.00E+00)
(1.00E+00 3.78E-01 1.00E+00)
(1.00E+00 4.04E-01 1.00E+00)
(1.00E+00 4.29E-01 1.00E+00)
(1.00E+00 4.52E-01 1.00E+00)
...
(1.00E+01 2.97E+00 1.00E+00)
